tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1703_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1703_H_
#define _PIC16LF1703_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define CCPIF                         53
#define SSP1IF                        54
#define ADIF                          55
#define TMR1GIF                       56
#define PIR2                          57
#define CCP2IF                        58
#define BCL1IF                        59
#define PIR3                          60
#define ZCDIF                         61
#define TMR0                          62
#define TMR1L                         63
#define TMR1H                         64
#define T1CON                         65
#define TMR1ON                        66
#define nT1SYNC                       67
#define T1OSCEN                       68
#define T1CKPS0                       69
#define T1CKPS                        70
#define T1CKPS1                       71
#define TMR1CS0                       72
#define TMR1CS                        73
#define TMR1CS1                       74
#define T1GCON                        75
#define T1GSS0                        76
#define T1GSS                         77
#define T1GSS1                        78
#define T1GVAL                        79
#define T1GGO_nDONE                   80
#define T1GSPM                        81
#define T1GTM                         82
#define T1GPOL                        83
#define TMR1GE                        84
#define TMR2                          85
#define PR2                           86
#define T2CON                         87
#define T2CKPS0                       88
#define T2CKPS                        89
#define T2CKPS1                       90
#define TMR2ON                        91
#define T2OUTPS0                      92
#define T2OUTPS                       93
#define T2OUTPS1                      94
#define T2OUTPS2                      95
#define T2OUTPS3                      96
#define TRISA                         97
#define TRISA0                        98
#define TRISA1                        99
#define TRISA2                        100
#define TRISA4                        101
#define TRISA5                        102
#define TRISC                         103
#define TRISC0                        104
#define TRISC1                        105
#define TRISC2                        106
#define TRISC3                        107
#define TRISC4                        108
#define TRISC5                        109
#define PIE1                          110
#define TMR1IE                        111
#define TMR2IE                        112
#define CCP1IE                        113
#define CCPIE                         114
#define SSP1IE                        115
#define ADIE                          116
#define TMR1GIE                       117
#define PIE2                          118
#define CCP2IE                        119
#define BCL1IE                        120
#define PIE3                          121
#define ZCDIE                         122
#define OPTION_REG                    123
#define PS                            124
#define PS0                           125
#define PS1                           126
#define PS2                           127
#define PSA                           128
#define T0SE                          129
#define TMR0SE                        130
#define T0CS                          131
#define TMR0CS                        132
#define INTEDG                        133
#define nWPUEN                        134
#define PCON                          135
#define nBOR                          136
#define nPOR                          137
#define nRI                           138
#define nRMCLR                        139
#define nRWDT                         140
#define STKUNF                        141
#define STKOVF                        142
#define WDTCON                        143
#define SWDTEN                        144
#define WDTPS                         145
#define WDTPS0                        146
#define WDTPS1                        147
#define WDTPS2                        148
#define WDTPS3                        149
#define WDTPS4                        150
#define OSCTUNE                       151
#define TUN0                          152
#define TUN                           153
#define TUN1                          154
#define TUN2                          155
#define TUN3                          156
#define TUN4                          157
#define TUN5                          158
#define OSCCON                        159
#define SCS0                          160
#define SCS                           161
#define SCS1                          162
#define IRCF                          163
#define IRCF0                         164
#define IRCF1                         165
#define IRCF2                         166
#define IRCF3                         167
#define SPLLEN                        168
#define OSCSTAT                       169
#define HFIOFS                        170
#define LFIOFR                        171
#define MFIOFR                        172
#define HFIOFL                        173
#define HFIOFR                        174
#define OSTS                          175
#define PLLR                          176
#define SOSCR                         177
#define ADRESL                        178
#define ADRESH                        179
#define ADCON0                        180
#define ADON                          181
#define GO_nDONE                      182
#define GO                            183
#define ADGO                          184
#define CHS0                          185
#define CHS                           186
#define CHS1                          187
#define CHS2                          188
#define CHS3                          189
#define CHS4                          190
#define ADCON1                        191
#define ADPREF0                       192
#define ADPREF                        193
#define ADPREF1                       194
#define ADNREF                        195
#define ADCS                          196
#define ADFM                          197
#define ADCON2                        198
#define TRIGSEL                       199
#define TRIGSEL0                      200
#define TRIGSEL1                      201
#define TRIGSEL2                      202
#define TRIGSEL3                      203
#define LATA                          204
#define LATA0                         205
#define LATA1                         206
#define LATA2                         207
#define LATA4                         208
#define LATA5                         209
#define LATC                          210
#define LATC0                         211
#define LATC1                         212
#define LATC2                         213
#define LATC3                         214
#define LATC4                         215
#define LATC5                         216
#define BORCON                        217
#define BORRDY                        218
#define BORFS                         219
#define SBOREN                        220
#define FVRCON                        221
#define ADFVR0                        222
#define ADFVR                         223
#define ADFVR1                        224
#define CDAFVR                        225
#define CDAFVR0                       226
#define CDAFVR1                       227
#define TSRNG                         228
#define TSEN                          229
#define FVRRDY                        230
#define FVREN                         231
#define ZCD1CON                       232
#define ZCD1INTN                      233
#define ZCD1INTP                      234
#define ZCD1POL                       235
#define ZCD1OUT                       236
#define ZCD1EN                        237
#define ANSELA                        238
#define ANSA0                         239
#define ANSA1                         240
#define ANSA2                         241
#define ANSA4                         242
#define ANSELC                        243
#define ANSC0                         244
#define ANSC1                         245
#define ANSC2                         246
#define ANSC3                         247
#define ANSC4                         248
#define ANSC5                         249
#define PMADRL                        250
#define PMADRH                        251
#define PMDATL                        252
#define PMDATH                        253
#define PMCON1                        254
#define RD                            255
#define WR                            256
#define WREN                          257
#define WRERR                         258
#define FREE                          259
#define LWLO                          260
#define CFGS                          261
#define PMCON2                        262
#define WPUA                          263
#define WPUA0                         264
#define WPUA1                         265
#define WPUA2                         266
#define WPUA3                         267
#define WPUA4                         268
#define WPUA5                         269
#define WPUC                          270
#define WPUC0                         271
#define WPUC1                         272
#define WPUC2                         273
#define WPUC3                         274
#define WPUC4                         275
#define WPUC5                         276
#define SSP1BUF                       277
#define BUF                           278
#define BUF0                          279
#define SSP1BUF0                      280
#define BUF1                          281
#define SSP1BUF1                      282
#define BUF2                          283
#define SSP1BUF2                      284
#define BUF3                          285
#define SSP1BUF3                      286
#define BUF4                          287
#define SSP1BUF4                      288
#define BUF5                          289
#define SSP1BUF5                      290
#define BUF6                          291
#define SSP1BUF6                      292
#define BUF7                          293
#define SSP1BUF7                      294
#define ADD0                          295
#define ADD                           296
#define SSP1ADD0                      297
#define SSP1ADD                       298
#define ADD1                          299
#define SSP1ADD1                      300
#define ADD2                          301
#define SSP1ADD2                      302
#define ADD3                          303
#define SSP1ADD3                      304
#define ADD4                          305
#define SSP1ADD4                      306
#define ADD5                          307
#define SSP1ADD5                      308
#define ADD6                          309
#define SSP1ADD6                      310
#define ADD7                          311
#define SSP1ADD7                      312
#define SSP1MSK0                      313
#define SSP1MSK                       314
#define MSK0                          315
#define MSK                           316
#define SSP1MSK1                      317
#define MSK1                          318
#define SSP1MSK2                      319
#define MSK2                          320
#define SSP1MSK3                      321
#define MSK3                          322
#define SSP1MSK4                      323
#define MSK4                          324
#define SSP1MSK5                      325
#define MSK5                          326
#define SSP1MSK6                      327
#define MSK6                          328
#define SSP1MSK7                      329
#define MSK7                          330
#define SSP1STAT                      331
#define BF                            332
#define UA                            333
#define R_nW                          334
#define S                             335
#define P                             336
#define D_nA                          337
#define CKE                           338
#define SMP                           339
#define SSP1CON1                      340
#define SSPM0                         341
#define SSPM                          342
#define SSPM1                         343
#define SSPM2                         344
#define SSPM3                         345
#define CKP                           346
#define SSPEN                         347
#define SSPOV                         348
#define WCOL                          349
#define SSP1CON2                      350
#define SEN                           351
#define RSEN                          352
#define PEN                           353
#define RCEN                          354
#define ACKEN                         355
#define ACKDT                         356
#define ACKSTAT                       357
#define GCEN                          358
#define SSP1CON3                      359
#define DHEN                          360
#define AHEN                          361
#define SBCDE                         362
#define SDAHT                         363
#define BOEN                          364
#define SCIE                          365
#define PCIE                          366
#define ACKTIM                        367
#define ODCONA                        368
#define ODA0                          369
#define ODA1                          370
#define ODA2                          371
#define ODA4                          372
#define ODA5                          373
#define ODCONC                        374
#define ODC0                          375
#define ODC1                          376
#define ODC2                          377
#define ODC3                          378
#define ODC4                          379
#define ODC5                          380
#define CCPR1L                        381
#define CCPR1H                        382
#define CCP1CON                       383
#define CCP1M0                        384
#define CCP1M                         385
#define CCP1M1                        386
#define CCP1M2                        387
#define CCP1M3                        388
#define CCP1Y                         389
#define DC1B                          390
#define DC1B0                         391
#define CCP1X                         392
#define DC1B1                         393
#define CCPR2L                        394
#define CCPR2H                        395
#define CCP2CON                       396
#define CCP2M                         397
#define CCP2M0                        398
#define CCP2M1                        399
#define CCP2M2                        400
#define CCP2M3                        401
#define DC2B0                         402
#define CCP2Y                         403
#define DC2B                          404
#define DC2B1                         405
#define CCP2X                         406
#define SLRCONA                       407
#define SLRA0                         408
#define SLRA1                         409
#define SLRA2                         410
#define SLRA4                         411
#define SLRA5                         412
#define SLRCONC                       413
#define SLRC0                         414
#define SLRC1                         415
#define SLRC2                         416
#define SLRC3                         417
#define SLRC4                         418
#define SLRC5                         419
#define INLVLA                        420
#define INLVLA0                       421
#define INLVLA1                       422
#define INLVLA2                       423
#define INLVLA3                       424
#define INLVLA4                       425
#define INLVLA5                       426
#define INLVLC                        427
#define INLVLC0                       428
#define INLVLC1                       429
#define INLVLC2                       430
#define INLVLC3                       431
#define INLVLC4                       432
#define INLVLC5                       433
#define IOCAP                         434
#define IOCAP0                        435
#define IOCAP1                        436
#define IOCAP2                        437
#define IOCAP3                        438
#define IOCAP4                        439
#define IOCAP5                        440
#define IOCAN                         441
#define IOCAN0                        442
#define IOCAN1                        443
#define IOCAN2                        444
#define IOCAN3                        445
#define IOCAN4                        446
#define IOCAN5                        447
#define IOCAF                         448
#define IOCAF0                        449
#define IOCAF1                        450
#define IOCAF2                        451
#define IOCAF3                        452
#define IOCAF4                        453
#define IOCAF5                        454
#define IOCCP                         455
#define IOCCP0                        456
#define IOCCP1                        457
#define IOCCP2                        458
#define IOCCP3                        459
#define IOCCP4                        460
#define IOCCP5                        461
#define IOCCN                         462
#define IOCCN0                        463
#define IOCCN1                        464
#define IOCCN2                        465
#define IOCCN3                        466
#define IOCCN4                        467
#define IOCCN5                        468
#define IOCCF                         469
#define IOCCF0                        470
#define IOCCF1                        471
#define IOCCF2                        472
#define IOCCF3                        473
#define IOCCF4                        474
#define IOCCF5                        475
#define OPA1CON                       476
#define OPA1PCH                       477
#define OPA1PCH0                      478
#define OPA1PCH1                      479
#define OPA1UG                        480
#define OPA1SP                        481
#define OPA1EN                        482
#define OPA2CON                       483
#define OPA2PCH                       484
#define OPA2PCH0                      485
#define OPA2PCH1                      486
#define OPA2UG                        487
#define OPA2SP                        488
#define OPA2EN                        489
#define PPSLOCK                       490
#define PPSLOCKED                     491
#define INTPPS                        492
#define T0CKIPPS                      493
#define T1CKIPPS                      494
#define T1GPPS                        495
#define CCP1PPS                       496
#define CCP2PPS                       497
#define SSPCLKPPS                     498
#define SSPDATPPS                     499
#define SSPSSPPS                      500
#define RA0PPS                        501
#define RA1PPS                        502
#define RA2PPS                        503
#define RA4PPS                        504
#define RA5PPS                        505
#define RC0PPS                        506
#define RC1PPS                        507
#define RC2PPS                        508
#define RC3PPS                        509
#define RC4PPS                        510
#define RC5PPS                        511
#define ICDBK0H                       512
#define BKA8                          513
#define BKA9                          514
#define BKA10                         515
#define BKA11                         516
#define BKA12                         517
#define BKA13                         518
#define BKA14                         519
#define STATUS_SHAD                   520
#define C_SHAD                        521
#define DC_SHAD                       522
#define Z_SHAD                        523
#define WREG_SHAD                     524
#define BSR_SHAD                      525
#define PCLATH_SHAD                   526
#define FSR0L_SHAD                    527
#define FSR0H_SHAD                    528
#define FSR1L_SHAD                    529
#define FSR1H_SHAD                    530
#define STKPTR                        531
#define TOSL                          532
#define TOSH                          533

#endif // _PIC16LF1703_H_
